class Vehicle:
    pass


class Car(Vehicle):
    information = {
        "Минск-Брест": (584.8, 239),
        "Минск-Гродно": (319.9, 179),
        "Минск-Гомель": (511.4, 221),
        "Минск-Витебск": (432.1, 202),
        "Минск-Могилёв": (312.9, 142),
    }  # "Точки маршрута": (Цена, длительность),


class Train(Vehicle):
    information = {
        "Минск-Брест": (17.45, 259),
        "Минск-Гродно": (11.38, 327),
        "Минск-Гомель": (12.93, 205),
        "Минск-Витебск": (10.28, 303),
        "Минск-Могилёв": (10.28, 387),
    }  # "Точки маршрута": (Цена, длительность),


class Plane(Vehicle):
    information = {
        "Минск-Брест": (105.6, 38),
        "Минск-Гродно": (78.54, 28),
        "Минск-Гомель": (95.7, 35),
        "Минск-Витебск": (75.9, 28),
        "Минск-Могилёв": (63.03, 23),
    }  # "Точки маршрута": (Цена, длительность),
